## :white_check_mark: terraform/aws/palserver:  tfmigrate plan

[Build link](https://github.com/boxp/arch/actions/runs/8270569830)

```
$ tfmigrate plan --out tfplan.binary
```

<details>


```
time="2024-03-13T19:38:35Z" level=info msg="download and unarchive the package" aqua_version=2.24.0 env=linux/amd64 exe_name=tfmigrate package_name=minamijoyo/tfmigrate package_version=v0.3.18 program=aqua registry=standard
2024/03/13 19:38:35 [INFO] AWS Auth provider used: "EnvProvider"
2024/03/13 19:38:36 [INFO] [runner] unapplied migration files: [20240313193138_import_ecr.hcl]
2024/03/13 19:38:36 [INFO] [runner] load migration file: tfmigrate/20240313193138_import_ecr.hcl
2024/03/13 19:38:36 [INFO] [migrator] start state migrator plan
2024/03/13 19:38:36 [INFO] [migrator@.] terraform version: 1.6.2
2024/03/13 19:38:36 [INFO] [migrator@.] initialize work dir
2024/03/13 19:38:39 [INFO] [migrator@.] get the current remote state
2024/03/13 19:38:41 [INFO] [migrator@.] override backend to local
2024/03/13 19:38:41 [INFO] [executor@.] create an override file
2024/03/13 19:38:41 [INFO] [migrator@.] creating local workspace folder in: terraform.tfstate.d/default
2024/03/13 19:38:41 [INFO] [executor@.] switch backend to local
2024/03/13 19:38:42 [INFO] [migrator@.] compute a new state
2024/03/13 19:38:45 [INFO] [migrator@.] check diffs
2024/03/13 19:38:50 [INFO] [migrator@.] unexpected diffs, ignoring as force option is true: failed to run command (exited 2): terraform plan -state=/tmp/tmp540546103 -input=false -no-color -detailed-exitcode -out=tfplan.binary
stdout:
aws_kms_key.ecr_kms: Refreshing state... [id=a2bcaab0-22fe-484a-90c3-9941aaf47047]
aws_ecr_repository.palserver: Refreshing state... [id=palserver]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_repository.palserver must be replaced
-/+ resource "aws_ecr_repository" "palserver" {
      ~ arn                  = "arn:aws:ecr:ap-northeast-1:839695154978:repository/palserver" -> (known after apply)
      ~ id                   = "palserver" -> (known after apply)
        name                 = "palserver"
      ~ registry_id          = "839695154978" -> (known after apply)
      ~ repository_url       = "839695154978.dkr.ecr.ap-northeast-1.amazonaws.com/palserver" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ encryption_configuration {
          ~ kms_key         = "arn:aws:kms:ap-northeast-1:839695154978:key/cacbd589-6f57-4ee1-bbb2-9230d4411a7f" -> "a2bcaab0-22fe-484a-90c3-9941aaf47047" # forces replacement
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

stderr:
2024/03/13 19:38:50 [INFO] [executor@.] remove the override file
2024/03/13 19:38:50 [INFO] [executor@.] remove the workspace state folder
2024/03/13 19:38:50 [INFO] [executor@.] switch back to remote
2024/03/13 19:38:53 [INFO] [migrator] state migrator plan success!

```


</details>

<!-- github-comment: {"JobName":"plan","SHA1":"18f9b56fde1162e5ec066eb458531070af59c679","TemplateKey":"tfmigrate-plan","Vars":{},"WorkflowName":"pull_request_target"} -->